Repository: creationPrimal/Kisukari.com_Mobile_App
Catalog: lib/l10n/app_*.arb
Languages: sw

# hello
source: Hey
sw: Habari

source: Start
sw: Anza

source: Welcome to
sw: Karibu

# welcomeNote
source: Managing diabetes can be challenging, but you're not alone. Don’t worry—our program is designed FOR YOU.
sw: Kudhibiti kisukari kunaweza kuwa changamoto, lakini hauko peke yako. Usijali Programu yetu imeundwa KWA AJILI YAKO.

# introUfuatiliaji
source: Comprehensive monitoring of treatment.
sw: Ufuatiliaji kikamilifu wa matibabu.

# introElimu
source: Education and advice from specialized experts for you.
sw: Elimu na ushauri wa wataalamu makhsusi kwa ajili yako

# introJukwaa
source: A community of people with more than
sw: Jukwaa la watu zaidi ya

# introJumuika
source: Join thousands of others like you.
sw: Jumuika na maelfu wengine kama wewe.

# introPataRipoti
source: Receive personalized reports and in-depth analysis from our experts.
sw: Pata ripoti za kibinafsi na uchambuzi wa kina kutoka kwa wataalamu wetu.

# introVipimo
source: Track and receive reminders about appointments and important tests at your clinic.
sw: Fuatilia na kumbushwa kuhusu mahudhurio na vipimo muhimu katika kliniki yako

# chooseLanguage
source: Select language
sw: Chagua Lugha

source: Language
sw: Lugha

source: Create Account
sw: Fungua Akaunti

source: Log In
sw: Ingia

# doyouhaveaccount
source: Do you have an account?
sw: Je! Tayari una akaunti?

# openNewAccount
source: Register a New account
sw: Fungua akaunti mpya

source: Nickname
sw: Jina la utani

source: Email
sw: Barua Pepe

source: Phone Number
sw: Namba ya simu

# useEmail
source: Use your email
sw: Tumia Barua pepe

# useNumber
source: Use your phone number
sw: Tumia namba ya simu

source: Password
sw: Neno siri

source: Confirm Password
sw: Hakiki Neno siri

# registerAgree
source: By registering, you are agreeing with our
sw: Kwa kujisajili, unakubali

source: terms of use
sw: masharti ya matumizi

source: and
sw: na

source: our privacy policies
sw: sera zetu za faragha

source: Register
sw: Jisajili

# ialreadyhaveanaccount
source: I have an account,
sw: Tayari nina akaunti,

# forgotPassword
source: Forgot your password?
sw: Umesahau Neno siri?

# welcomeBack
source: Welcome Again!
sw: Karibu Tena!

source: Confirm
sw: Hakiki

source: Save
sw: Tunza

source: Confirm Phone Number
sw: Hakiki Namba ya simu

# confirmPhonenumberContent
source: Enter the numbers sent to your phone number!
sw: Andika namba ulizotumiwa kwenye namba yako ya simu!

# notreceivedotp
source: Haven't received the message?
sw: Hujapokea ujumbe wa uthibitisho?

# resendotp
source: Press here to resend the OTP.
sw: Bonyeza hapa kutuma tena

# firstintrohead
source: Please, we would like to know you better so that we can serve you well.
sw: Tafadhali tungependa kukufahamu zaidi ili tuweze kukuhudumia vyema

source: Your date of birth.
sw: Tarehe yako ya kuzaliwa.

source: Date of birth
sw: Tarehe ya kuzaliwa

source: Select Date
sw: Chagua Tarehe

# selectGender
source: Select your gender
sw: Chagua jinsia

source: Gender
sw: Jinsia

source: Male
sw: Me

source: Female
sw: Ke

# sugarMeasurements
source: What type of blood sugar measurements do you use?
sw: Unatumia vipimo gani vya sukari?

# sugarMeasurementsType
source: Type of measurement
sw: Aina ya kipimo

source: Body measurements.
sw: Vipimo vya mwili.

source: Height
sw: Urefu

source: Centimeter
sw: Sentimeta

source: Feet
sw: Futi

source: Weight
sw: Uzito

source: Pounds
sw: Pauni

# continueNext
source: Continue
sw: Endelea

# selectDiabetesType
source: Please specify your type of diabetes.
sw: Tafadhali eleza aina ya kisukari uliyonayo.

# diabetesType
source: Type of diabetes
sw: Aina ya kisukari

# diabetesType1
source: Type 1 Diabetes
sw: Aina ya kwanza

# diabetesType2
source: Type 2 Diabetes
sw: Aina ya pili

source: Gestational Diabetes
sw: Kisukari cha mimba

# otherTypeDiabetes
source: Other types
sw: Aina nyinginezo

# noDiabetes
source: Not diabetic
sw: Sina kisukari

# idontknowDiabetes
source: I don’t know
sw: Sijui

# diabetesType1Desc
source: Diabetes due to low or no insulin production by pancreas, thus requiring lifetime insulin therapy.
sw: Kisukari kutokana na kutengenezwa insulini kidogo kwenye kongosho, na huhitaji insulini maisha yote.

# diabetesType2Desc
source: Diabetes due to insulin resistance and deficiency, requiring medications and lifestyle changes
sw: Kisukari kutokana na usugu na upungufu wa insulini huhitaji dawa na mabadiliko ya mtindo wa maisha.

# gestationalDiabetesDesc
source: Diabetes first detected after first 3 months of pregnancy, and usually subsides after birth.
sw: Kisukari kilichogundulika kwa mara ya kwanza baada ya miezi 3 ya ujauzito, na hupona baada ya kujifungua.

# otherTypeDiabetesDesc
source: Choose this if you are having other forms of diabetes such as MODY, LADA, etc.
sw: Chagua hili ikiwa una aina nyingine za kisukari kama vile MODY, LADA, n.k.

# noDiabetesDesc
source: Choose this if you are not diabetic and using the app for prevention.
sw: Chagua hili ikiwa huna kisukari na unatumia app kwa ajili ya kujikinga.

# idontknowDiabetesDesc
source: Choose this if you are unaware or not sure. You should clarify this with your doctor.
sw: Chagua hili ikiwa huna uhakika au hujui. Unapaswa kuhakiki hili na daktari wako.

# selectDiabeticDuration
source: Sorry, we would like to know how long you have had diabetes.
sw: Pole, tungependa kujua umekua na kisukari kwa muda gani.

# diabeticDirationSelectionLabel
source: Select
sw: Chagua

source: This week
sw: Wiki hii

source: This month
sw: Mwezi huu

# twoToSixMonths
source: 2-6 months
sw: Miezi 2-6

# sixToTwelveMonths
source: 6-12 months
sw: Miezi 6-12

# oneToTwoYears
source: 1-2 years
sw: Mwaka 1-2

# threeToFiveYears
source: 3-5 years
sw: Miaka 3-10

# fiveToTenYears
source: 5-10 years
sw: Miaka 5-10

# tenPlusYears
source: 10+ years
sw: Miaka 10+

# introTypeofmedicationtitle
source: What type of treatment are you receiving?
sw: Ni aina gani ya matibabu unayopokea?

# typeofmedication
source: Type of treatment
sw: Aina ya matibabu

source: Insulin
sw: Insulini

source: Pills
sw: Vidonge

# dietandexcercise
source: Diet and exercise
sw: Lishe na mazoezi

source: Alternative treatments
sw: Matibabu mbadala

source: Not on treatment
sw: Sina matibabu yoyote

source: Select
sw: Chagua

source: Ciggaretes
sw: Sigara

# hookah
source: Hookah (sheesha)
sw: Shisha

# cigars
source: Cigars / pipe tobacco
sw: Misokoto / kiko

source: Snuff
sw: Ugoro

source: Cannabis
sw: Bangi

# introsubstancestitle
source: Do you use substances such as alcohol or tobacco products (eg. Cigarettes)?
sw: Je unatumia vilevi kama pombe au bidhaa za tumbaku (mf. Sigara) ?

source: Yes
sw: Ndio

source: No
sw: Hapana

# substancesselecttitle
source: Please choose and provide details below
sw: Tafadhali chagua na utueleze hapo chini

# substanceschoiceone
source: Cigarettes and tobacco products
sw: sigara na bidhaa za tumbaku

# substanceschoicetwo
source: Alcohol
sw: Pombe

# cigarateschoicestitle
source: Choose the type of tobacco products.
sw: Chagua aina ya bidhaa za tumbaku.

# cigarateschoicessubtitle
source: Product types
sw: Aina ya bidhaa

# alcoholchoicetitle
source: Choose alcohol type and quantity.
sw: Chagua aina na kiasi cha pombe.

source: Type
sw: Aina

# quantityperweek
source: Quantity/Week
sw: Kiasi/Wiki

# alcoholchoiceone
source: Beer
sw: Bia

# alcoholchoicetwo
source: Wine
sw: Divai (wine)

# alcoholchoicethree
source: Spirits (vodka, etc.)
sw: Pombe kali (vodka, nk.)

# alcoholchoicefour
source: Liqueurs (Jägermeister, etc.)
sw: Mvinyo (Jägermeister, nk.)

# alcoholchoicefive
source: Local brew
sw: Pombe za kienyeji

# alcoholchoiceqtyone
source: bottle
sw: Chupa

# alcoholchoiceqtytwo
source: glass
sw: Glasi

# alcoholchoiceqtythree
source: shot
sw: Shoti

source: Do you have other diseases?
sw: Je! Una magonjwa mengineyo?

# doyouhaveotherdiseasestwo
source: Do you have other diseases?
sw: Je! Una magonjwa mengine?

# doyouhaveotherdiseasestwosubtitle
source: We would like to know them please.
sw: Tungependa kuyafahamu tafadhali.

# infousagesubtitle
source: These details will help us in your treatment.
sw: Taarifa hizi zitatusaidia kwenye matibabu yako.

# selectamongthesediseases
source: Please choose from the following diseases.
sw: Tafadhali chagua kati ya magonjwa yafuatayo.

# textTyping
source: Type..
sw: Andika..

source: Add disease
sw: Ongeza ugonjwa

# bloodPressureDisease
source: Blood Pressure
sw: Shinikizo la damu

source: Heart diseases
sw: Magonjwa ya moyo

source: kidney diseases
sw: Magonjwa ya figo

# hivDisease
source: HIV infections
sw: Maambukizi ya UKIMWI

# tbDisease
source: Tuberculosis (TB)
sw: Kifua Kikuu

# heavyweightDisease
source: Obesity
sw: Uzito Mkubwa

# resultsCongrats
source: Congratulations!
sw: Hongera!

# resultsCongratsSub
source: We have reviewed the results and prepared recommendations on how we can help you manage diabetes.
sw: Tumepitia majibu na kuandaa mapendekezo juu ya jinsi tunavyoweza kukusaidia kudhibiti kisukari.

# resultsSugarlevels
source: Sugar levels
sw: Viwango vya sukari

# resultsBeforemeal
source: Before meal
sw: Kabla ya chakula

# resultsAftermeal
source: After meal
sw: Baada ya chakula

# resultsbplevels
source: Blood pressure levels
sw: Viwango vya shinikizo la damu

# resultsCalorieslevels
source: Calorie levels
sw: Viwango vya kalori

# resultsFoodCalorie1
source: Do not consume more than
sw: Usile zaidi ya kalori

# resultsFoodCalorie2
source: calories per day
sw: kwa siku

# resultsExcerciseCalorie1
source: Burn at least
sw: Choma angalau kalori

# resultsExcerciseCalorie2
source: calories per day
sw: kwa siku

# resultsExcerciselevels
source: Exercise levels and types
sw: Viwango na aina ya mazoezi

# resultssteps
source: Steps
sw: Hatua

# resultsExcercisetarget
source: Target:
sw: Lengo:

# resultsExcercisetarget2
source: 10,000 steps per day
sw: Hatua 10,000 Kwa siku

# resultExcercise
source: Exercise
sw: Mazoezi

# resultExcercisetime
source: 30 minutes per day
sw: Dakika 30 Kwa siku

# resultExcerciselevelmedium
source: Moderate exercise
sw: Mazoezi ya wastani

# resultWeightLevels
source: Weight levels and advice
sw: Viwango vya uzito na ushauri

# resultHighWeightLevels
source: OVERWEIGHT
sw: UZITO MKUBWA

# resultWeightminimize
source: You can lose 4 kg per month.
sw: Unaweza kupunguza 4 kg kwa mwezi.

# resultGraphtitle
source: Gradually reduce weight by at least 1 kg per week
sw: Punguza uzito taratibu angalau 1 kg kwa wiki

# resultAddictiontitle
source: Advice on tobacco and alcohol use
sw: Ushauri kuhusu matumizi ya tumbaku na vilevi

# resultAddictioncigarette
source: Please quit smoking and using tobacco products
sw: Tafadhali acha uvutaji wa sigara na matumizi ya bidhaa za tumbaku

# resultAddictioncialcoholtitle
source: Consider moderate alcohol consumption.
sw: Zingatia unywaji wa wastani wa pombe.

# resultAddictioncialcoholsub1
source: ● Do not exceed two drinks per day
sw: ● Usizidishe vinywaji viwili kwa siku

# resultAddictioncialcoholsub2
source: ● Drink on alternating days
sw: ● Kunywa kwa kupishanisha siku

# navbarToday
source: Today
sw: Leo

# navbarReport
source: Reports
sw: Ripoti

# navbarCommunity
source: Community
sw: Jamii

# navbarMore
source: More
sw: Zaidi

source: Good Morning
sw: Habari za asubuhi

source: Good Afternoon
sw: Habari za mchana

source: Good Evening
sw: Habari za jioni

# dontforgetreminder
source: Don't forget to check your sugar levels and take your medication.
sw: Usisahau kupima sukari na dawa zako

# homesugar
source: Glucose
sw: Sukari

source: Average A1C
sw: Wastani A1C

# hometarget
source: Target
sw: Lengo

# homenotifications
source: Notifications
sw: Taarifa

# homeLowSugarLevel
source: LOW GLUCOSE LEVEL
sw: SUKARI IKO CHINI

# homepressHere
source: Press here
sw: Bonyeza hapa

# homebloodpressure
source: Blood Pressure
sw: Shinikizo la damu

# homeheartbeat
source: Heart Beat
sw: Mapigo ya moyo

# homepills
source: Pills
sw: Vidonge

# homeDay
source: Day
sw: Siku

# homeInsulin
source: Insulin
sw: Insulini

# homeSteps
source: Steps
sw: Hatua

# homeExcercise
source: Excercises
sw: Mazoezi

# homeFood
source: Food
sw: Chakula

# homeCarbohydrate
source: Carb
sw: Wanga

# homeFullCarbohydrate
source: Carbohydrate
sw: Wanga

# homeProtein
source: Protein
sw: Protini

# homeFat
source: Fat
sw: Mafuta

# homeRemindersTitle
source: Reminders
sw: Kumbusho zijazo

# homeRemindersSugar
source: Measure Glucose
sw: Kupima sukari

# homeRemindersInsulin
source: Inject insulin
sw: Kuchoma Insulini

# homeRemindersExcercise
source: Exercise
sw: Kufanya mazoezi

# homeMyclinic
source: My clinic
sw: Kliniki yangu

# homeHospitalname
source: Hospital name
sw: Jina la hospitali

# homeHospitallastvisit
source: Last visit date
sw: Tarehe ya mwisho kuhudhuria

# homeHospitalupcomingdate
source: Upcoming date
sw: Tarehe inayofuata

# homeHospitaladdinfo
source: Add information
sw: Jaza taarifa zako

# homeHospitalcustomerservicetitle
source: Mr. Kisukari is ready to assist you
sw: Mr. Kisukari yupo tayari kukusaidia

# hometalktous
source: Press here!
sw: Bofya hapa!

# homeFastTitle
source: Fast (Intermittent Fasting)
sw: Funga (Intermittent Fasting)

# homeFastType
source: Fasting type
sw: Aina ya funga

# homeFasthours
source: Hours
sw: Masaa

# homeFaststart
source: Starting
sw: Kuanza

# homeFasttoday
source: Today
sw: Leo

# homeFastreport
source: Report
sw: Ripoti

# homeFastend
source: Ending
sw: Kumaliza

# homeFastendfast
source: End Fast
sw: Maliza Mfungo

# homeCliniccounterdays
source: Days
sw: Siku

# homeCliniccounterremaining
source: Remaining
sw: Zimebaki

# reportscreentitle
source: Reports and Progress
sw: Ripoti na maendeleo

# report7days
source: 7 Days
sw: Siku 7

# report14days
source: 14 Days
sw: Siku 14

# report30days
source: 30 Days
sw: Siku 30

# reportselectdays
source: Custom
sw: Chagua

# reportcreatereport
source: Create report
sw: Tengeneza ripoti

# reportcreatereportfirstday
source: Initial date
sw: Tarehe ya kwanza

# reportcreatereportlastday
source: Last date
sw: Tarehe ya mwisho

# reportGlucose
source: Glucose
sw: Sukari

# reportBp
source: Blood Pressure
sw: Presha

# reportInsulin
source: Insulin
sw: Insulini

# reportMedicine
source: Medicine
sw: Dawa

# reportExcercise
source: Excercise
sw: Mazoezi

# reportFood
source: Food
sw: Chakula

# reportFasting
source: Fasting
sw: Funga

# reportWeight
source: Weight
sw: Uzito

# reportClinic
source: Clinic
sw: Kliniki

# reportNotes
source: Notes
sw: Notisi

# reportReminder
source: Reminder
sw: Ukumbusho

# reportReporttype
source: Choose report type
sw: Chagua aina ya ripoti

# reportDownloadpdf
source: Download Report (pdf)
sw: Pakua Ripoti (pdf)

# reportPiechartLow
source: Low
sw: Chini

# reportPiechartaverage
source: Average
sw: Wastani

# reportPiechartHigh
source: High
sw: Juu

# reporttabledate
source: Date
sw: Tarehe

# reporttabletime
source: Time
sw: Muda

# reporttablereading
source: Readings
sw: Kipimo

# reporttablepressure
source: Blood Pressure
sw: Presha

# reporttableheartbeat
source: Heart Beat
sw: Mapigo ya moyo

# reportBptopreadingAvBp
source: Average Blood Pressure
sw: Wastani wa presha

# reportBptopreadingHeartBeat
source: Heart Beat
sw: Mapigo ya moyo

# reportInsulintopreadingavinsulin
source: The average insulin level per day
sw: Wastani wa kiwango cha insulini kwa siku

# reportInsulintopreadingwaterinsulin
source: Of Water
sw: Ya maji

# reportInsulintopreadingmilkinsulin
source: Of milk
sw: Ya maziwa

source: Total
sw: Jumla

# reportmedicinemymedicine
source: My medicines
sw: Dawa zangu

# reportmedicineperday
source: Per day
sw: Kwa siku

# reportmedicineperweek
source: Week
sw: wiki

# reportmedicineviewmore
source: View more
sw: Fungua zaidi

# reportmedicineviewless
source: Minimize
sw: Punguza

# reportmedicineMedicinetype
source: Medicine type
sw: Aina ya dawa

# reportmedicineQty
source: Quantity
sw: Idadi

# reportexcerciseweeklysnap
source: Weekly Snapshot
sw: Muhtasari wa kila wiki

# reportexcercisecalorie
source: Calorie
sw: Kalori

# reportexcerciseburnt
source: Burnt
sw: Ulizochoma

# reportexcerciseweeklytarget
source: Weekly target
sw: Lengo la wiki

# reportexcercisesteps
source: Steps
sw: Hatua

# reportexcercisewalked
source: Walked
sw: Ulizotembea

# reportexcerciseate
source: Consumed
sw: Ulizokula

# reportexcerciseactivities
source: Activities
sw: Shughuli

# reportexcercisetime
source: Time
sw: Muda

# reportexcercisedistance
source: Distance
sw: Umbali

# reportexcerciseburntcalories
source: Calores burnt
sw: Kalori ulizochoma

# reportexcercisetimedk
source: Time(Mn)
sw: Muda(dk)

# reportfastingtotalhours
source: Total hours
sw: Jumla ya masaa

# reportfastingminutes
source: Minutes
sw: Dakika

# reportfastingincomplete
source: Incomplete
sw: Hazikukamilika

# reportfastingcompleted
source: Complete
sw: Zilizokamilika

# reportweightmyprogress
source: My Progress
sw: Maendeleo yangu

# reportclinicremainingdays
source: Remaining days to attend
sw: Siku zilizobaki kuhudhulia

# reportclinicbelowbtncontactus
source: For more information about clinic, Please press below.
sw: Kwa taarifa zaidi kuhusu kliniki, Bonyeza hapa chini.

# morescreenPremiumtitle
source: Premium
sw: Malipo ya juu

# morescreenPremiumBtntitle
source: Pay today to get more services.
sw: Lipia leo upate huduma zaidi.

# morescreenMyclinic
source: My Clinic
sw: Kliniki yangu

# morescreenTest
source: Self-Test
sw: Jipime

# morescreenTestTitle
source: Risk Assessment
sw: Uchunguzi wa hatari

# morescreenFastingBtn
source: Fasting (Intermittent Fasting)
sw: Mfungo (Intermittent Fasting)

# morescreenFastingBtnContent
source: A dietary method involving alternating periods of eating and fasting. It can help with weight loss and improve health by controlling blood sugar levels.
sw: Mbinu ya lishe inayohusisha kubadilisha vipindi vya kula na kufunga. Inaweza kusaidia kupunguza uzito na kuboresha afya kwa kudhibiti viwango vya sukari mwilini.

# morescreenPlansBtn
source: My Health Plans and Goals
sw: Mipango na malengo yangu ya afya

# morescreenHealthTools
source: Connect Devices
sw: Unganisha vifaa

# morescreenProfileBtn
source: My Profile
sw: Wasifu wangu

# morescreenSettingsBtn
source: App Settings
sw: Matengenezo ya app

# morescreenPolicyBtn
source: Policies, Terms, and Conditions
sw: Sera , sheria na masharti

# morescreenHelpBtn
source: Help and Contacts
sw: Msaada na mawasiliano

# morescreenLogOutBtn
source: Log out
sw: Ondoka

# premiumSelectplan
source: Select plan
sw: Chagua mpango

# premiummonths
source: Months
sw: Miezi

# premiumyears
source: Years
sw: Miaka

# premiumpermonth
source: Per month
sw: Kwa Mwezi

# premiumperyear
source: Per year
sw: Kwa Mwaka

# premiumPaynow
source: Pay now
sw: Lipia sasa

# premiumPayments
source: Payments
sw: Malipo

# premiumChoosePayments
source: Choose payment method.
sw: Chagua njia ya malipo.

# premiumPay
source: Pay
sw: Lipia

# fastingMainTitle
source: Intermittent Fasting
sw: Mfungo wa chakula

# fastingProtocals
source: Protocals
sw: Itifaki

# fastingFastingProtocals
source: Fasting Protocals
sw: Itifaki za mfungo

# fastingTips
source: Tips
sw: Vidokezo

# fastingTipstopTitle
source: What is intermittent fasting?
sw: Mfungo wa chakula ni nini?

# fastingTipssubTitle
source: Tips for success
sw: Itifaki za mafanikio

# appProfileTitle
source: Profile
sw: Wasifu

# appSettingsTitle
source: Settings
sw: Matengenezo

# appSettingsPermissions
source: permissions and consent
sw: Ruhusa na Idhini

# appSettingssubscriptionstatus
source: Subscription status
sw: Hali ya usajili

# appSettingsdeleteaccount
source: Delete account
sw: Futa akaunti

# appSettingsnotificationOn
source: On
sw: Washa

# appSettingsnotificationOff
source: Off
sw: Zima

# appSettingssubscriptionactive
source: Active
sw: Hai

# appSettingssubscriptionending
source: Ending
sw: Inaisha

# appSettingssubscriptionduration
source: Duration
sw: Muda

# appSettingssubscriptionend
source: Cancel
sw: Sitisha

# selftestWelcome
source: Welcome to the diabetes risk calculator.
sw: Karibu kwenye kikokotoo cha hatari ya kua na kisukari.

# selftestWelcomeText1
source: This calculator is not a substitute for professional diabetes testing. It is designed for those who are unaware of their diabetes status and aims to indicate the risk of developing type 2 diabetes.
sw: Kikokotoo hiki sio mbadala wa uchunguzi wa kitaalamu wa kisukari. Kikokotoo kimeundwa kwa ajili ya wale ambao hawajajua hali yao kuhusu kisukari, na kinalenga kuonyesha hatari ya mtu kuugua kisukari aina ya pili.

# selftestWelcomeText2
source: This calculator does not address the risk of type 1 diabetes or gestational diabetes.
sw: Kikokotoo hiki hakiangazii hatari kwa kisukari aina ya kwanza au kisukari cha mimba.

# selftestWelcomeText3
source: To find out your risk of developing type 2 diabetes in the next five years, answer the following short questions.
sw: Ili kujua hatari yako ya kuugua kisukari aina ya pili katika kipindi cha miaka mitano ijayo, jibu maswali mafupi yafuatayo.

# selftestWelcomeStartTest
source: Start Self-Assessment
sw: Anza Kujipima

# selftestWelcomeReference
source: Source
sw: Chanzo

# selftestScreen1gendertitle
source: What is your gender?
sw: NI IPI JINSIA YAKO?

# selftestScreen1genderbody
source: Men are more likely than women to have undiagnosed diabetes; one reason might be that men are less likely to visit their doctor regularly.
sw: Wanaume wana uwezekano mkubwa zaidi kuliko wanawake kuwa na kisukari kisichojulikana; sababu moja inaweza kuwa ni kwamba wanaume wana uwezekano mdogo wa kumwona daktari wao mara kwa mara.

# selftestback
source: Back
sw: Nyuma

# selftestforward
source: Next
sw: Mbele

# selftestScreen2agetitle
source: HOW OLD ARE YOU?
sw: JE! UNA UMRI GANI?

# selftestScreen2agebody
source: The older you get, the higher your risk of developing type 2 diabetes increases.
sw: Kadri unavyozeeka, ndivyo hatari yako ya kuugua kisukari aina ya pili inavyoongezeka.

# selftestScreen2belowage
source: Years below
sw: Chini ya miaka

# selftestScreen2years
source: Years
sw: Miaka

# selftestScreen3affirmtitle
source: DO YOU HAVE A MOTHER, FATHER, SISTER, OR BROTHER WITH DIABETES?
sw: JE! UNA MAMA, BABA, DADA, AU KAKA MWENYE KISUKARI?

# selftestScreen3affirmbody
source: A family history of diabetes can contribute to your risk of developing type 2 diabetes.
sw: Historia ya kisukari katika familia inaweza kuchangia hatari yako ya kuugua kisukari aina ya pili.

# selftestScreen4affirmtitle
source: HAVE YOU EVER BEEN DIAGNOSED WITH HIGH BLOOD PRESSURE?
sw: JE! UMEWAHI KUGUNDULIKA KUWA NA SHINIKIZO LA DAMU (PRESHA)?

# selftestScreen4affirmbody
source: Having high blood pressure contributes to your overall risk of developing type 2 diabetes.
sw: Kuwa na shinikizo la damu kunachangia hatari yako ya jumla ya kuugua kisukari aina ya pili.

# selftestScreen5affirmtitle
source: DO YOU EXERCISE REGULARLY?
sw: JE! HUWA UNAFANYA MAZOEZI?

# selftestScreen5affirmbody
source: Lack of exercise can increase your risk of developing type 2 diabetes.
sw: Kutokufanya mazoezi kunaweza kuongeza hatari yako ya kuugua kisukari aina ya pili

# selftestScreen6affirmtitle
source: WHAT IS YOUR ETHNICITY OR RACE?
sw: WEWE NI JAMII AU KABILA LIPI?

# selftestScreen6affirmbody
source: Research shows that certain ethnicities and races are at a higher risk of developing type 2 diabetes than others.
sw: Tafiti zinaonyesha kuwa makabila na jamii fulani wana uwezekano mkubwa zaidi wa kuugua kisukari aina ya pili kuliko wengine.

# selftestScreen6choice1
source: African or African American
sw: Mwafrika au mmarekani mweusi

# selftestScreen6choice2
source: Native American or Alaska Native
sw: Muhindi mmarekani au wa asili ya Alaska
