Repository: creationPrimal/Kisukari.com_Mobile_App
Catalog: lib/l10n/app_*.arb
Languages: sw

# selftestScreen6choice3
source: Native Hawaiian or Other Pacific Islander
sw: Mwenye asili ya Hawaii au Mtu wa visiwa vingine vya Pasifiki

# selftestScreen6choice4
source: Hispanic and/or Latino
sw: Mwenye asili ya Kihispania na/au Mlatino

# selftestScreen6choice5
source: White or Caucasian
sw: Mzungu mweupe

# selftestScreen6choice6
source: Asian
sw: Mwenye asili ya bara Asia

# selftestScreen6choice7
source: Other ethnicities and races
sw: Jamii na kabila nyinginezo

# selftestScreen7title
source: WHAT IS YOUR HEIGHT AND WEIGHT?
sw: JE! NI KIPI KIMO CHA UREFU WAKO NA UZITO?

# selftestScreen7body
source: The combination of your weight and height helps us determine your Body Mass Index (BMI). People with a higher BMI are at greater risk.
sw: Mchanganyiko wa uzito wako na urefu wako hutusaidia kujua Indeksi ya Masi ya Mwili (BMI) yako. Watu wenye BMI ya juu wana hatari kubwa zaidi.

# selftestScreen7fillweight
source: Enter your weight
sw: Jaza uzito wako

# selftestScreen7fillheight
source: Enter your height
sw: Jaza urefu wako

# selftestResultHead
source: Results
sw: Majibu

# selftestResulttitle
source: YOUR TOTAL SCORE IS
sw: ALAMA ZAKO JUMLA NI

# selftestResultinfo
source: Your risk of having type 2 diabetes is HIGH.
sw: Hatari yako ya kuwa na kisukari aina ya pili ni KUBWA.

# selftestResultbody
source: Only your doctor can confirm if you have diabetes. These conditions often show no symptoms, so if you haven't seen a healthcare provider, don't wait.
sw: Ni daktari wako pekee ndiye anayeweza kuthibitisha kama una kisukari. Hali hizi mara nyingi hazioneshi dalili zozote, hivyo kama hujaona mtoa huduma wa afya, usisubiri.

# selftestResultfinish
source: Finish
sw: Maliza

# goalsHead
source: Plans and goals
sw: Mipango na malengo

# goalsLevel
source: Level
sw: Kiwango

# goalscalorieintake
source: Calorie intake
sw: Kulaji kalori

# goalscalorieburnt
source: Burn Calories
sw: Poteza kalori

# goalsedit
source: Edit Goals
sw: Badili taarifa

# communityMainHome
source: Home
sw: Nyumbani

# communityMainGroups
source: Groups
sw: Makundi

# communityMainFriends
source: Friends
sw: Marafiki

# communityMainFavourites
source: Favourites
sw: Pendwa

# communityPhoto
source: Photo
sw: Picha

# communityPhotos
source: Photos
sw: Picha

# communityVideos
source: Videos
sw: Video

# communityNewpost
source: New Post
sw: Chapisho Mpya

# communityPostcontent
source: Upload Post
sw: Chapisha

# communityMembers
source: Members
sw: Wanachama

# communityMyGroups
source: My groups
sw: Makundi yangu

# communityMoreGroups
source: More groups
sw: Makundi zaidi

# communityJoinGroup
source: Join
sw: Jiunge

# communityMessages
source: Messages
sw: Meseji

# communityDelete
source: Delete
sw: Futa

# communityTypemessage
source: Type a message
sw: Andika meseji

# communitySearch
source: Search
sw: Tafuta

# communityShare
source: Share
sw: Shiriki

# communityViewPost
source: View post
sw: Fungua chapisho

# communityPost
source: Post
sw: Chapisho

# communityGroupInfo
source: Information
sw: Taarifa

# communityLeaveGroup
source: Leave Group
sw: Jiondoe

# communityInvite
source: Invite
sw: Karibisha

# risktestassessmentbody
source: Cardiovascular disease risk assessment
sw: Chagua uchunguzi unaofaa na jibu maswali mafupi yanayofuata. Utapewa alama na kuwekewa kiwango cha hatari kwa usahihi.

# risktestsugartest
source: Diabetes risk assessment
sw: uchunguzi wa hatari ya kupata kisukari

# risktestwoundstest
source: Foot ulcer risk assessment
sw: uchunguzi wa hatari ya kupata vidonda miguuni

# risktestmental
source: Mental health risk assessment
sw: uchunguzi wa hatari ya afya ya akili

# woundtestTitlecontent
source: Welcome to the foot ulcer risk calculator.
sw: Karibu kwenye kikokotoo cha hatari ya kupata vidonda miguuni.

# woundtestfirstlinebody
source: This calculator is not a substitute for a professional medical examination.
sw: Kikokotoo hiki sio mbadala wa uchunguzi wa kitaalamu.

# woundtestsecondlinebody
source: This calculator is designed to help you assess if you are at risk of developing foot ulcers.
sw: Kikokotoo hiki kimeundwa kwa ajili ya kukusaidia kugundua kama uko kwenye hatari ya kupatwa na vidonda miguuni.

# woundtestthirdlinebody
source: These ulcers may take a long time to heal, become infected, and may even lead to amputation.
sw: Vidonda hivivinaweza kuchukua muda mrefu kupona, kupatwa maambukizi, na hata kusababishwa kukatwa miguu.

# woundtestfourthlinebody
source: To assess yourself, please answer the following questions.
sw: Ili kujichunguza, tafadhali jibu maswali yafuatayo.

# woundtesthistoryTitle
source: Risk assessment for foot ulcers.
sw: uchunguzi wa hatari ya kupata vidonda miguuni.

# woundtesthistoryTitlebody
source: Please answer the questions below by pressing the appropriate button.
sw: Tafadhari jibu maswali hapo chini kwa kubonyeza kitufe kinachohusika.

# woundtesthistorysubTitle
source: Your History
sw: Historia yako

# woundtesthistoryqstn1
source: 1. Have you ever had part of your leg amputated?
sw: 1. Je! umewahi kukatwa sehemu ya mguu?

# woundtesthistoryqstn2
source: 2. Have you ever had foot ulcers?
sw: 2. Je! umewahi kupata vidonda vya mguu?

# woundtesthistoryqstn3
source: 3. Do you have any kidney disease?
sw: 3. Je! una shida ya ugonjwa wa figo?

# woundtestlegstitle
source: Leg Examination
sw: Uchunguzi wa miguu

# woundtestlegsqstn1
source: 1. Do you have numbness in your legs?
sw: 1. Je! una ganzi miguuni?

# woundtestlegsqstn2
source: 2. Do you have issues with blood vessels in your legs?
sw: 2. Je! unamatatizo ya mishipa ya damu ya miguuni?

# woundtestlegsqstn3
source: 3. Do you have any disability in your legs?
sw: 3. Je! una ulemavu wowote wa mguu?

# woundtestlegsqstn4
source: 4. Do you have calluses on your feet?
sw: 4. Je! una sugu kwenye miguu?

# woundtestresulttitle
source: YOUR RISK LEVEL IS
sw: DARAJA LAKO LA HATARI NI

# woundtestresultcomment
source: Your risk of developing foot ulcers is HIGH.
sw: Hatari yako ya kuwa na vidonda vya miguuni ni KUBWA.

# woundtestresultbody
source: We advise you to visit a healthcare facility with foot care specialists for further examination.
sw: Tunakushauri kwenda kwenye kituo cha kutolea huduma chenye wataalamu wa kuhudumia miguu kwa ajili ya uchunguzi zaidi.

# woundtestresulttipstitle
source: You need to take extra care to protect your feet from ulcers and do the following:
sw: Unahitaji kuongeza umakini katika kulinda miguu yako ili isipate vidonda pamoja na kufanya yafuatayo:

# woundtestresulttip1
source: 1. Inspect your feet daily. Ask for help or use a mirror.
sw: 1. Kukagua miguu yako kila siku. Omba usaidizi au tumia kioo.

# woundtestresulttip2
source: 2. Wash your feet daily with lukewarm water and dry them with a clean towel.
sw: 2. Kuosha miguu yako kila siku kwa maji vuguvugu na kuikausha kwa kitambaa safi.

# woundtestresulttip3
source: 3. Trim your toenails carefully straight across and smooth the edges to prevent ingrown nails.
sw: 3. Kukata kucha zako kwa umakini moja kwa moja na punguza pembe zake ili kuzuia kucha kuota ndani.

# woundtestresulttip4
source: 4. Wear proper shoes that are not tight and allow airflow.
sw: 4. Vaa viatu sahihi visivyo bana na vyenye kupitisha hewa.

# woundtestresulttip5
source: 5. Do not walk barefoot without shoes.
sw: 5. Usitembee peku bila viatu.

# woundtestresulttip6
source: 6. Apply oil to your feet with non-lotion oils.
sw: 6. Pakaa mafuta kwenye miguu yako kwa mafuta yasiyo ‘losheni’

# woundtestresulttip7
source: 7. Do not use hot water to wash your feet, or engage in activities that may injure your feet.
sw: 7. usitumie maji ya moto kuoshea miguu, au shughuli zinazoweza kuumiza miguu

# mentaltestmaintitle
source: Welcome to the Depression Risk Calculator.
sw: Karibu kwenye kikokotoo cha hatari ya kuwa na unyogovu (Depression).

# mentaltestmainline1
source: This calculator is not a substitute for professional diagnosis.
sw: Kikokotoo hiki sio mbadala wa uchunguzi wa kitaalamu.

# mentaltestmainline2
source: This calculator is designed to help you determine if you are at risk of depression.
sw: Kikokotoo hiki kimeundwa kwa ajili ya kukusaidia kugundua kama uko kwenye hatari ya kupatwa na unyogovu (Depression).

# mentaltestmainline3
source: This calculator focuses on your mental state over the past 2 weeks.
sw: Kikokotoo hiki kinalenga kuwaangazia hali yako ya kiakili ndani ya wiki 2 zilizopita.

# mentaltestmainline4
source: To assess yourself, please answer the following questions.
sw: Ili kujichunguza, tafadhali jibu maswali yafuatayo.

# mentalqstnstitle
source: Depression Assessment
sw: Uchunguzi wa unyogovu (Depression)

# mentalqstnsbody
source: Please answer each of the following questions by selecting the most appropriate response, about how you have felt in the past two weeks.
sw: Tafadhali jibu kila moja ya maswali yafuatayo kwa kuchagua jibu linalofaa zaidi, kuhusu jinsi ulivyojihisi katika wiki mbili zilizopita.

# mentalqstn1
source: 1. I have felt happy and in good spirits.
sw: 1. Nimejihisi mwenye furaha na katika hali nzuri ya kiroho.

# mentalqstn1choice1
source: 0 - Never
sw: 0 - Hakuna wakati wowote

# mentalqstn1choice2
source: 1 - Occasionally
sw: 1 - Wakati fulani

# mentalqstn1choice3
source: 2 - Less than half of the time
sw: 2 - Chini ya nusu ya wakati

# mentalqstn1choice4
source: 3 - More than half of the time
sw: 3 - Zaidi ya nusu ya wakati

# mentalqstn1choice5
source: 4 - Most of the time
sw: 4 - Mara nyingi

# mentalqstn1choice6
source: 5 - All the time
sw: 5 - Muda wote

# mentalqstn2
source: 2. I have felt calm and at peace.
sw: 2. Nimejihisi mtulivu na mwenye amani.

# mentalqstn3
source: 3. I have felt energetic and lively.
sw: 3. Nimejihisi mwenye nguvu na mchangamfu.

# mentalqstn4
source: 4. I have woken up feeling good and not tired.
sw: 4. Nimeamka nikiwa na hisia nzuri na sijachoka.

# mentalqstn5
source: 5. My daily life is full of things that interest me.
sw: 5. Maisha yangu ya kila siku yamejaa mambo yanayonivutia.

# mentalresultscomment
source: Your risk of having depression is HIGH.
sw: Hatari yako ya kuwa na msongo wa mawazo ni KUBWA.

# mentalresultsbody
source: A score below 13 may indicate well-being and could be a sign of depression or other mental health issues. It is recommended to consult a healthcare professional, such as a psychologist, psychiatrist, or primary healthcare provider, for a thorough assessment.
sw: Alama chini ya 13 inaweza kuashiria ustawiduni na inaweza kuwa ishara ya unyogovu au matatizo mengine ya afya ya akili. Inashauriwa kushauriana na mtaalamu wa afya, kama vile saikolojia, saikaitriki, au mtoa huduma wa afya ya msingi, kwa ajili ya tathmini ya kina.

# hearttesttitle
source: Welcome to the heart disease risk calculator for the next 10 years.
sw: Karibu kwenye kikokotoo cha hatari ya kupata magonjwa ya moyo ndani ya miaka 10 ijayo.

# hearttestline1
source: This calculator is not a substitute for professional medical advice.
sw: Kikokotoo hiki sio mbadala wa uchunguzi wa kitaalamu.

# hearttestline2
source: This tool is designed for those who have not been diagnosed with heart disease and aims to estimate the risk of developing heart disease in the next 10 years.
sw: Kikokotoo hiki kimeundwa kwa ajili ya wale ambao hawajagundulika kuwa na magomjwa ya moyo, na hivyo kinalenga kuonyesha hatari ya mtu kuugua magonjwa ya moyo ndani ya miaka 10 ijayo.

# hearttestline3
source: To know your risk of developing heart disease in the next 10 years, please answer the following short questions.
sw: Ili kujua hatari yako ya kuugua magonjwa ya moyo ndani ya miaka 10 ijayo, jibu maswali mafupi yafuatayo.

# hearttestqstnstitle
source: Heart Examination
sw: Uchunguzi wa moyo

# hearttestqstnsbody
source: Please answer the questions by filling in and selecting the correct answers.
sw: Tafadhali jibu maswali kwa kujaza na kuchaguamajibu sahihi.

# hearttestsmocking
source: Do you smoke?
sw: Je! unavuta sigara?

# hearttestcommunityname
source: What is your ethnicity or race?
sw: Je! wewe ni jamii gani?

# hearttestqstn1
source: 1. Do you have diabetes?
sw: 1. Je! unakisukari?

# hearttestqstn2
source: 2. Do you use blood pressure medication?
sw: 2. Je! unatumia dawa za presha?

# hearttestqstn3
source: 3. Please measure your blood pressure and fill it in below
sw: 3. Tafadhali pima presha yako na ujaze hapo chini

# hearttestbloodpressure
source: Blood pressure level
sw: Kiwango cha shinikizo la damu

# hearttestqstn4
source: 4. Please fill in your cholesterol measurements below.
sw: 4. Tafadhali jaza vipimo vya mafuta hapo chini.

# hearttestselectmeasurements
source: Select measurement system
sw: Chagua mfumo wa kipimo

# hearttesttotlacholesteral
source: Total cholesterol
sw: Cholesteral jumla

# hearttestresultcomment
source: Your risk of heart disease is HIGH.
sw: Hatari yako ya kupata magonjwa ya moyo ni KUBWA.

# hearttestresultbody
source: It is important to make significant lifestyle changes, such as a heart-healthy diet, regular exercise, and maintaining a healthy weight. We recommend consulting a cardiologist.
sw: Ni muhimu kufanya mabadiliko makubwa ya mtindo wa maisha, kama vile lishe yenye afya kwa moyo, mazoezi ya mara kwa mara, na kudumisha uzito wenye afya.Tunashauri kumuona dakatari wa moyo.
